In [64]:
#import the require libraries
import pandas as pd 
import numpy as np

# Loading and saving data with pandas

In [38]:
# read all input files
df_excel = pd.read_excel('input_files/regions.xlsx')
df_csv = pd.read_csv('input_files/Names.csv', header=None)
df_text = pd.read_csv('input_files/data.txt', delimiter='\t')

In [39]:
print(df_excel)

  Region  Units  Sales  Export
0  South     54    332     100
1  North     20    110      50
2   East     36    224      85
3   West     60    400     110
4   West     50    226      65
5  North     84    470     150

In [40]:
print(df_csv)

                     0         1                                 2  \
0                 John       Doe                 120 jefferson st.
1                 Jack  McGinnis                      220 hobo Av.
2        John "Da Man"    Repici                 120 Jefferson St.
3              Stephen     Tyler  7452 Terrace "At the Plaza" road
4                  NaN  Blankman                               NaN
5  Joan "Danger", Anne       Jet               9th, at Terrace plc

             3    4      5       6
0    Riverside   NJ   8074   45000
1        Phila   PA   9119   18000
2    Riverside   NJ   8075  120000
3     SomeTown   SD  91234   90000
4     SomeTown   SD    298   30000
5  Desert City   CO    123   68000

In [41]:
print(df_text)

                ID  EGF_Baseline  EGF_Stimulus
0      FBgn0029994         -1.25         -0.27
1      FBgn0037191         -1.05          0.78
2      FBgn0036810          2.08          1.34
3      FBgn0033320          1.15          0.45
4      FBgn0051156         -1.77         -0.76
...            ...           ...           ...
11761  FBgn0026136          0.57          1.23
11762  FBgn0037356          1.14         -0.95
11763  FBgn0038214         -1.86         -0.67
11764  FBgn0042110          1.49          0.43
11765  FBgn0034202         -1.32         -0.22

[11766 rows x 3 columns]

# Viewing and inspecting data with pandas

In [42]:
# create a new excel file with header and index 
df_csv.columns = ['First', 'Last', 'Address', 'City', 'State', 'Area Code', 'Income']
df_csv.to_excel('output_files/modifed.xlsx')
print(df_csv.columns)

Index(['First', 'Last', 'Address', 'City', 'State', 'Area Code', 'Income'], dtype='object')

In [43]:
#print only the last name column
print(df_csv['Last'])

0         Doe
1    McGinnis
2      Repici
3       Tyler
4    Blankman
5         Jet
Name: Last, dtype: object

In [44]:
# print only the three last name 
print(df_csv['Last'][0:3])

0         Doe
1    McGinnis
2      Repici
Name: Last, dtype: object

In [45]:
# print first and last name 
print(df_csv[['First', 'Last']])

                 First      Last
0                 John       Doe
1                 Jack  McGinnis
2        John "Da Man"    Repici
3              Stephen     Tyler
4                  NaN  Blankman
5  Joan "Danger", Anne       Jet

In [46]:
#using iloc : uisng only intger| print a specific cell
print(df_csv.iloc[2,1])

Repici

In [47]:
# save only few columns in new excel 
wanted_value = df_csv[['First', 'Last', 'State']]
stored = wanted_value.to_excel('output_files/State_location.xlsx', index=None)

# Filter and sort data with pandas

In [48]:
# print all where city is Riverside
print(df_csv.loc[df_csv['City']=='Riverside'])

           First    Last            Address       City State  Area Code  \
0           John     Doe  120 jefferson st.  Riverside    NJ       8074
2  John "Da Man"  Repici  120 Jefferson St.  Riverside    NJ       8075

   Income
0   45000
2  120000

In [49]:
# if we have two conditions 
print(df_csv.loc[(df_csv['City']=='Riverside') & (df_csv['First']=='John')] )

  First Last            Address       City State  Area Code  Income
0  John  Doe  120 jefferson st.  Riverside    NJ       8074   45000

### create a columns

In [50]:
# create new column with a tax
df_csv['Tax %'] = df_csv['Income'].apply(lambda x : 0.15 if 10000 < x < 40000 else 0.20 if 40000 < x < 80000 else 0.25)
print(df_csv)

                 First      Last                           Address  \
0                 John       Doe                 120 jefferson st.
1                 Jack  McGinnis                      220 hobo Av.
2        John "Da Man"    Repici                 120 Jefferson St.
3              Stephen     Tyler  7452 Terrace "At the Plaza" road
4                  NaN  Blankman                               NaN
5  Joan "Danger", Anne       Jet               9th, at Terrace plc

          City State  Area Code  Income  Tax %
0    Riverside    NJ       8074   45000   0.20
1        Phila    PA       9119   18000   0.15
2    Riverside    NJ       8075  120000   0.25
3     SomeTown    SD      91234   90000   0.25
4     SomeTown    SD        298   30000   0.15
5  Desert City    CO        123   68000   0.20

In [58]:
# create new column after the tax
df_csv['Tax owed'] = df_csv['Tax %'] * df_csv['Income']
print(df_csv)

                 First      Last                           Address  \
0                 John       Doe                 120 jefferson st.
1                 Jack  McGinnis                      220 hobo Av.
2        John "Da Man"    Repici                 120 Jefferson St.
3              Stephen     Tyler  7452 Terrace "At the Plaza" road
4                  NaN  Blankman                               NaN
5  Joan "Danger", Anne       Jet               9th, at Terrace plc

          City State  Area Code  Income  Tax %  Tax owed  Test col
0    Riverside    NJ       8074   45000   0.20    9000.0     False
1        Phila    PA       9119   18000   0.15    2700.0      True
2    Riverside    NJ       8075  120000   0.25   30000.0     False
3     SomeTown    SD      91234   90000   0.25   22500.0     False
4     SomeTown    SD        298   30000   0.15    4500.0      True
5  Desert City    CO        123   68000   0.20   13600.0     False

### Drop columns

In [52]:
to_drop = ['Area Code', 'First', 'Address']
df_csv.drop(columns=to_drop)

       Last         City State  Income  Tax %  Tax owed
0       Doe    Riverside    NJ   45000   0.20    9000.0
1  McGinnis        Phila    PA   18000   0.15    2700.0
2    Repici    Riverside    NJ  120000   0.25   30000.0
3     Tyler     SomeTown    SD   90000   0.25   22500.0
4  Blankman     SomeTown    SD   30000   0.15    4500.0
5       Jet  Desert City    CO   68000   0.20   13600.0

In [57]:
df_csv['Test col'] = False
df_csv.loc[df_csv['Income'] < 40000, 'Test col'] = True
df_csv

,First,Last,Address,City,State,Area Code,Income,Tax %,Tax owed,Test col
0,John,Doe,120 jefferson st.,Riverside,NJ,8074,45000,0.20,9000.0,False
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119,18000,0.15,2700.0,True
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075,120000,0.25,30000.0,False
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234,90000,0.25,22500.0,False
4,NaN,Blankman,NaN,SomeTown,SD,298,30000,0.15,4500.0,True
5,"Joan ""Danger"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123,68000,0.20,13600.0,False

### goup & sort

In [63]:
print(df_csv.groupby(['Test col']).mean().sort_values('Income'))

          Area Code   Income  Tax %  Tax owed
Test col
True         4708.5  24000.0  0.150    3600.0
False       26876.5  80750.0  0.225   18775.0

# Cleaning data with pandas